Revit.Elements.Revision
Revit Revision

Revit.Elements.Revision.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.Revision.InternalElement
Reference to the Element

Revit.Elements.Revision.#ctor(Autodesk.Revit.DB.Revision)
Create from an existing Revit Element

Revit.Elements.Revision.#ctor(System.String,Autodesk.Revit.DB.RevisionVisibility,System.String,System.String,System.Boolean,System.String,System.String,Autodesk.Revit.DB.RevisionNumberType)
Create Revision
name:
visibility:
revDate:
description:
issued:
issuedBy:
issuedTo:
numberType:

Revit.Elements.Revision.InternalSetElement(Autodesk.Revit.DB.Revision)
Set the internal Element, ElementId, and UniqueId

Revit.Elements.Revision.Init(System.String,Autodesk.Revit.DB.RevisionVisibility,System.String,System.String,System.Boolean,System.String,System.String,Autodesk.Revit.DB.RevisionNumberType)
Create new Revision
name:
visibility:
revDate:
description:
issued:
issuedBy:
issuedTo:
numberType:

Revit.Elements.Revision.ByName(System.String,System.String,System.String,System.Boolean,System.String,System.String,System.String,System.String)
Construct a new Revit Revision by Name
name: Revision Name
visibility: Visibility settings
revDate: Revision Date
description: Description
issued: Issuing status
issuedBy: Issued by
issuedTo: Issued to
numberType: Number type
Returns:

Revit.Elements.Revision.RevisionDate
Get Revision Date

Revit.Elements.Revision.SetRevisionDate(System.String)
Set Revision Date
value: Revision Date

Revit.Elements.Revision.IssuedTo
Get IssuedTo

Revit.Elements.Revision.SetIssuedTo(System.String)
Set IssuedTo
value: IssuedTo

Revit.Elements.Revision.IssuedBy
Get IssuedBy

Revit.Elements.Revision.SetIssuedBy(System.String)
Set IssuedBy
value: IssuedBy

Revit.Elements.Revision.Issued
Get Issued

Revit.Elements.Revision.SetIssued(System.Boolean)
Set Issued
value: Issued

Revit.Elements.Revision.FromExisting(Autodesk.Revit.DB.Revision,System.Boolean)
Create Revision from existing element
instance:
isRevitOwned:
Returns: